console.log( 2 + 2 );

// console.log: Выводит сообщение в консоль браузера.
// 2 + 2: Арифметическое сложение двух чисел.
// Результат: 4
// Тип данных: Number
// Особенности:
//     Арифметическое сложение выполняется с использованием оператора +.
//     Результат сложения двух чисел 2 и 2 — это 4.

console.log( 2 - 1 );

// console.log: Выводит сообщение в консоль браузера.
// 2 - 1: Арифметическое вычитание двух чисел.
// Результат: 1
// Тип данных: Number
// Особенности:
//     Арифметическое вычитание выполняется с использованием оператора -.
//     Результат вычитания 1 из 2 — это 1.

console.log( 4 / 2 );

// console.log: Выводит сообщение в консоль браузера.
// 4 / 2: Арифметическое деление двух чисел.
// Результат: 2
// Тип данных: Number
// Особенности:
//     Арифметическое деление выполняется с использованием оператора /.
//     Результат деления 4 на 2 — это 2.

console.log( 8 * 7 );

// console.log: Выводит сообщение в консоль браузера.
// 8 * 7: Арифметическое умножение двух чисел.
// Результат: 56
// Тип данных: Number
// Особенности:
//     Арифметическое умножение выполняется с использованием оператора *.
//     Результат умножения 8 на 7 — это 56.

console.log( 8 ** 2 );

// console.log: Выводит сообщение в консоль браузера.
// 8 ** 2: Возведение числа 8 в степень 2.
// Результат: 64
// Тип данных: Number
// Особенности:
//     Возведение в степень выполняется с использованием оператора **.
//     Результат возведения 8 в степень 2 — это 64.

console.log( 5 % 2 );

// console.log: Выводит сообщение в консоль браузера.
// 5 % 2: Остаток от деления 5 на 2.
// Результат: 1
// Тип данных: Number
// Особенности:
//     Остаток от деления вычисляется с использованием оператора %.
//     Результат остатка от деления 5 на 2 — это 1.

let num1 = 10

// let: Объявляет переменную с областью видимости в блоке кода.
// num1: Имя переменной, которая содержит значение 10.
// 10: Присвоенное значение типа Number.
// Тип данных: Number
// Особенности:
//     Переменной num1 присваивается числовое значение 10.

let num2 = 5

// let: Объявляет переменную с областью видимости в блоке кода.
// num2: Имя переменной, которая содержит значение 5.
// 5: Присвоенное значение типа Number.
// Тип данных: Number
// Особенности:
//     Переменной num2 присваивается числовое значение 5.

let sum = num1 + num2

// let: Объявляет переменную с областью видимости в блоке кода.
// sum: Имя переменной, которой присваивается результат сложения num1 и num2.
// num1 + num2: Арифметическое сложение двух чисел 10 и 5.
// Результат: 15
// Тип данных: Number
// Особенности:
//     Переменной sum присваивается результат сложения переменных num1 и num2.
//     Итоговое значение переменной sum — это 15.


// Архитектура и работа:
//     console.log — это метод объекта console, который используется для вывода информации в консоль браузера.
//     Арифметические операции выполняются с использованием операторов +, -, *, /, ** и %.
//     Переменные объявляются с помощью ключевого слова let, что ограничивает их область видимости текущим блоком кода.
//     Переменные могут содержать данные различных типов, таких как Number.
//     Арифметические операции возвращают значения типа Number.
